{"format": "graph-model", "generatedBy": "2.10.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/digit_recognition/Layer1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "564"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/digit_recognition/Layer1/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "564"}]}}}}}, {"name": "StatefulPartitionedCall/digit_recognition/Layer2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "564"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/digit_recognition/Layer2/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/digit_recognition/Out/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/digit_recognition/Out/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/digit_recognition/Layer1/MatMul", "op": "MatMul", "input": ["input_1", "StatefulPartitionedCall/digit_recognition/Layer1/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/digit_recognition/Layer1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/digit_recognition/Layer1/MatMul", "StatefulPartitionedCall/digit_recognition/Layer1/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/digit_recognition/Layer1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/digit_recognition/Layer1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/digit_recognition/Layer2/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/digit_recognition/Layer1/Relu", "StatefulPartitionedCall/digit_recognition/Layer2/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/digit_recognition/Layer2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/digit_recognition/Layer2/MatMul", "StatefulPartitionedCall/digit_recognition/Layer2/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/digit_recognition/Layer2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/digit_recognition/Layer2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/digit_recognition/Out/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/digit_recognition/Layer2/Relu", "StatefulPartitionedCall/digit_recognition/Out/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/digit_recognition/Out/add", "op": "AddV2", "input": ["StatefulPartitionedCall/digit_recognition/Out/MatMul", "StatefulPartitionedCall/digit_recognition/Out/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/digit_recognition/Out/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/digit_recognition/Out/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/digit_recognition/Out/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/digit_recognition/Layer1/MatMul/ReadVariableOp", "shape": [784, 564], "dtype": "float32"}, {"name": "StatefulPartitionedCall/digit_recognition/Layer1/add/ReadVariableOp", "shape": [564], "dtype": "float32"}, {"name": "StatefulPartitionedCall/digit_recognition/Layer2/MatMul/ReadVariableOp", "shape": [564, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/digit_recognition/Layer2/add/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/digit_recognition/Out/MatMul/ReadVariableOp", "shape": [64, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/digit_recognition/Out/add/ReadVariableOp", "shape": [10], "dtype": "float32"}]}]}